spec/fixtures/json/cryptomus_payment_services.json

{
  "state": 0,
  "result": [
    {
      "network": "ETH",
      "currency": "VERSE",
      "is_available": true,
      "limit": {
        "min_amount": "2500.00000000",
        "max_amount": "10000000.00000000"
      },
      "commission": {
        "fee_amount": "0.00",
        "percent": "2.00"
      }
    },
    {
      "network": "ETH",
      "currency": "DAI",
      "is_available": true,
      "limit": {
        "min_amount": "1.00000000",
        "max_amount": "10000000.00000000"
      },
      "commission": {
        "fee_amount": "0.00",
        "percent": "2.00"
      }
    },
    {
      "network": "TON",
      "currency": "TON",
      "is_available": true,
      "limit": {
        "min_amount": "0.00100000",
        "max_amount": "1000000.00000000"
      },
      "commission": {
        "fee_amount": "0.00",
        "percent": "2.00"
      }
    },
    {
      "network": "ETH",
      "currency": "USDT",
      "is_available": true,
      "limit": {
        "min_amount": "1.00000000",
        "max_amount": "100000.00000000"
      },
      "commission": {
        "fee_amount": "0.00",
        "percent": "2.00"
      }
    },
    {
      "network": "BCH",
      "currency": "BCH",
      "is_available": true,
      "limit": {
        "min_amount": "0.00100000",
        "max_amount": "10000000.00000000"
      },
      "commission": {
        "fee_amount": "0.00",
        "percent": "2.00"
      }
    },
    {
      "network": "XMR",
      "currency": "XMR",
      "is_available": true,
      "limit": {
        "min_amount": "0.00100000",
        "max_amount": "1000000.00000000"
      },
      "commission": {
        "fee_amount": "0.00",
        "percent": "2.00"
      }
    },
    {
      "network": "DASH",
      "currency": "DASH",
      "is_available": true,
      "limit": {
        "min_amount": "0.02000000",
        "max_amount": "1000000.00000000"
      },
      "commission": {
        "fee_amount": "0.00",
        "percent": "2.00"
      }
    },
    {
      "network": "BSC",
      "currency": "BNB",
      "is_available": true,
      "limit": {
        "min_amount": "0.00500000",
        "max_amount": "1000000.00000000"
      },
      "commission": {
        "fee_amount": "0.00",
        "percent": "2.00"
      }
    },
    {
      "network": "BSC",
      "currency": "DAI",
      "is_available": true,
      "limit": {
        "min_amount": "1.00000000",
        "max_amount": "10000000.00000000"
      },
      "commission": {
        "fee_amount": "0.00",
        "percent": "2.00"
      }
    },
    {
      "network": "DOGE",
      "currency": "DOGE",
      "is_available": true,
      "limit": {
        "min_amount": "1.00000000",
        "max_amount": "10000000.00000000"
      },
      "commission": {
        "fee_amount": "0.00",
        "percent": "2.00"
      }
    },
    {
      "network": "POLYGON",
      "currency": "USDC",
      "is_available": true,
      "limit": {
        "min_amount": "1.00000000",
        "max_amount": "10000000.00000000"
      },
      "commission": {
        "fee_amount": "0.00",
        "percent": "2.00"
      }
    },
    {
      "network": "BSC",
      "currency": "CGPT",
      "is_available": true,
      "limit": {
        "min_amount": "10.00000000",
        "max_amount": "10000000.00000000"
      },
      "commission": {
        "fee_amount": "0.00",
        "percent": "2.00"
      }
    },
    {
      "network": "TRON",
      "currency": "USDC",
      "is_available": true,
      "limit": {
        "min_amount": "1.00000000",
        "max_amount": "10000000.00000000"
      },
      "commission": {
        "fee_amount": "0.00",
        "percent": "2.00"
      }
    },
    {
      "network": "ETH",
      "currency": "USDC",
      "is_available": true,
      "limit": {
        "min_amount": "1.00000000",
        "max_amount": "10000000.00000000"
      },
      "commission": {
        "fee_amount": "0.00",
        "percent": "2.00"
      }
    },
    {
      "network": "BSC",
      "currency": "USDT",
      "is_available": true,
      "limit": {
        "min_amount": "0.50000000",
        "max_amount": "1000000.00000000"
      },
      "commission": {
        "fee_amount": "0.00",
        "percent": "2.00"
      }
    },
    {
      "network": "TRON",
      "currency": "USDT",
      "is_available": true,
      "limit": {
        "min_amount": "1.00000000",
        "max_amount": "100000.00000000"
      },
      "commission": {
        "fee_amount": "0.00",
        "percent": "2.00"
      }
    },
    {
      "network": "TRON",
      "currency": "TRX",
      "is_available": true,
      "limit": {
        "min_amount": "1.00000000",
        "max_amount": "1000000.00000000"
      },
      "commission": {
        "fee_amount": "0.00",
        "percent": "2.00"
      }
    },
    {
      "network": "BSC",
      "currency": "BUSD",
      "is_available": true,
      "limit": {
        "min_amount": "1.00000000",
        "max_amount": "1000000.00000000"
      },
      "commission": {
        "fee_amount": "0.00",
        "percent": "2.00"
      }
    },
    {
      "network": "BSC",
      "currency": "USDC",
      "is_available": true,
      "limit": {
        "min_amount": "1.00000000",
        "max_amount": "10000000.00000000"
      },
      "commission": {
        "fee_amount": "0.00",
        "percent": "2.00"
      }
    },
    {
      "network": "POLYGON",
      "currency": "MATIC",
      "is_available": true,
      "limit": {
        "min_amount": "0.50000000",
        "max_amount": "1000000.00000000"
      },
      "commission": {
        "fee_amount": "0.00",
        "percent": "2.00"
      }
    },
    {
      "network": "TRON",
      "currency": "BUSD",
      "is_available": true,
      "limit": {
        "min_amount": "1.00000000",
        "max_amount": "10000000.00000000"
      },
      "commission": {
        "fee_amount": "0.00",
        "percent": "2.00"
      }
    },
    {
      "network": "POLYGON",
      "currency": "DAI",
      "is_available": true,
      "limit": {
        "min_amount": "1.00000000",
        "max_amount": "10000000.00000000"
      },
      "commission": {
        "fee_amount": "0.00",
        "percent": "2.00"
      }
    },
    {
      "network": "BTC",
      "currency": "BTC",
      "is_available": true,
      "limit": {
        "min_amount": "0.00002000",
        "max_amount": "100.00000000"
      },
      "commission": {
        "fee_amount": "0.00",
        "percent": "2.00"
      }
    },
    {
      "network": "ETH",
      "currency": "MATIC",
      "is_available": true,
      "limit": {
        "min_amount": "1.00000000",
        "max_amount": "10000000.00000000"
      },
      "commission": {
        "fee_amount": "0.00",
        "percent": "2.00"
      }
    },
    {
      "network": "LTC",
      "currency": "LTC",
      "is_available": true,
      "limit": {
        "min_amount": "0.02000000",
        "max_amount": "1000000.00000000"
      },
      "commission": {
        "fee_amount": "0.00",
        "percent": "2.00"
      }
    },
    {
      "network": "ETH",
      "currency": "ETH",
      "is_available": true,
      "limit": {
        "min_amount": "0.01000000",
        "max_amount": "1000.00000000"
      },
      "commission": {
        "fee_amount": "0.00",
        "percent": "2.00"
      }
    },
    {
      "network": "POLYGON",
      "currency": "USDT",
      "is_available": true,
      "limit": {
        "min_amount": "0.50000000",
        "max_amount": "1000000.00000000"
      },
      "commission": {
        "fee_amount": "0.00",
        "percent": "2.00"
      }
    },
    {
      "network": "ETH",
      "currency": "BUSD",
      "is_available": true,
      "limit": {
        "min_amount": "1.00000000",
        "max_amount": "10000000.00000000"
      },
      "commission": {
        "fee_amount": "0.00",
        "percent": "2.00"
      }
    }
  ]
}
